&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
	// Получить текущую строку табличной части.
	СтрокаТабличнойЧасти = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
	// Установить цену.
	СтрокаТабличнойЧасти.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, СтрокаТабличнойЧасти.Номенклатура);
	// Пересчитать сумму строки
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	//Элементы.Менеджер = ПолучитьПользователя();
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователя()
    Перем ВыбПользователь;
    ВыбПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
    Возврат ВыбПользователь.ПолноеИмя;
КонецФункции

&НаСервере
Процедура ПолучитьМенеджеров()
	Запрос = Новый Запрос();
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.Наименование КАК ФИО
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники";
	
	РезультатЗапроса = Запрос.Выполнить();
 
    ВыборкаВкусов = РезультатЗапроса.Выбрать();
 
    Пока ВыборкаВкусов.Следующий() Цикл
        Сообщить(ВыборкаВкусов.ФИО);
	КонецЦикла;	 
КонецПроцедуры